# TriangulationInterfaceForTriangulatedSolidOrShell Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulationInterfaceForTriangulatedSolidOrShell Constructor
TriangulationInterfaceForTriangulatedSolidOrShell Class See Also
---
Construct an interface object for a TriangulatedSolidOrShell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell externalTriangulatedSolidOrShell
)
```

Visual Basic
---
```text
Public Sub New ( _
	externalTriangulatedSolidOrShell As TriangulatedSolidOrShell _
)
```

Visual C++
---
```text
public:
TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell^ externalTriangulatedSolidOrShell
)
```

# ### Parameters
externalTriangulatedSolidOrShell
    Type: Autodesk.Revit.DB..::..TriangulatedSolidOrShell The TriangulatedSolidOrShell that the interface object represents.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace